{"1":{"title":"What If Voting Became Mandatory in the United States?","des":"Washington Post opinion columnist E.J. Dionne Jr. votes at Walt Whitman High School in Bethesda, Maryland. He delights in casting his ballot at a school whose namesake is the poet of American democracy. Dionne, who is also a professor at Georgetown University, has partnered with Miles Rapoport, former Connecticut secretary of the state, in a campaign to implement a universal voting requirement in the United States. Several countries already require voting by everyone who is eligible, including Australia, Brazil, Peru and Uruguay, providing real world examples of how it might work.","video":"video\/n1.jpg"},"2":{"title":"Wages Rise for Many, But Not for Californians Most Hit by Inflation","des":"When I met Amparo Ramirez in March of 2020, our conversation was very much of the moment. The pandemic was in its early days and the fear factor was high, but Ramirez, who works in food service at the Los Angeles International Airport, was explaining that even if she felt ill, she would most likely report for her shift — and so would her colleagues.\r\n\r\n“If you miss work, they look at you differently,” she told me through a translator, speaking of her supervisors at LSG Sky Chefs, one of the world’s largest airline food catering services. “I cannot afford to miss.”","video":"video\/n2.jpg"},"3":{"title":"LABOR & ECONOMYDay Laborers Pay a Steep Price Working in California Fire Zones","des":"When wildfires consumed large parts of Santa Rosa in 2017, Anabel Garcia and scores of her co-workers were sent into the fire zone by temporary labor companies subcontracting with insurers. Their job was to clean damaged buildings. Garcia, who, like many of the others, usually worked picking crops in the fields, and who had recently finished a hazardous job harvesting grapes in the middle of the fire zone, was assigned to sweep out the debris at a local health clinic.\r\n\r\n“I had to take out furniture, carpeting. They didn’t give us anything to cover ourselves — just helmets so nothing hard would fall on our heads,” the 41-year-old day laborer, who has been in the U.S. for a quarter of a century, recalls, speaking through a translator. “They didn’t even give us water to drink. It was a very difficult job. After two to three days, it rained, and water got to the first floor. We collected the water and threw it in the toilets.”","video":"video\/n3.jpg"},"4":{"title":"Gov. Newsom Vetoes Union Vote-by-Mail Bill for Farmworkers","des":"Almost before the farmworker voting rights march set out for Sacramento last week, their 217-mile pilgrimage was cut short by the governor’s veto of the bill they supported.\r\n\r\nThe march sought to press Gov. Gavin Newsom to sign a bill that would have brought farmworker union elections into line with the voting process used in California general elections. Instead, the governor refused to allow changes in a 50-year-old election process that workers say favors growers — changes that he has advocated for in general elections, like the recall vote he just overcame.","video":"video\/n4.jpg"},"5":{"title":"A Hollow Boom for New Mexico","des":"Our weak president threatens both America’s honor and freedom itself by pandering to dictators, limp Europeans and climate hoaxers in his drive to destroy the oil and gas industry with high gas prices. He and other politicians need to get out of the way of American oil and gas companies so they can get to work and drill, drill, drill us to energy independence.\r\n\r\nAt least, that’s what some politicians and lobbying groups are saying. But numbers more complex than the gas station bottom line tell a decidedly different story, one corroborated by economists both in New Mexico and farther afield — and by oil and gas producers themselves.\r\n\r\nProducers have thousands of unused federal drilling permits — 1,040 in New Mexico alone. There are so many that President Joe Biden has threatened fines for not using them. Drilling rig counts haven’t followed increases in prices. Oilfield jobs in New Mexico are still down more than 20% since the COVID-19-triggered market collapse in March 2020. And perhaps most telling, in a survey of oil and gas producers conducted by the Dallas Federal Reserve Bank a month after the start of the Russian-Ukrainian war, the majority of producers said they had no plans to dramatically increase production in the next year.","video":"video\/n5.jpg"}}